'''
Элементами множеств А, P и Q являются натуральные числа, 
причём P = {2, 4, 6, 8, 10, 12, 14, 16, 18, 20} и 
Q = {3, 6, 9, 12, 15, 18, 21, 24, 27, 30}. Известно, что выражение

((x ∈ A) → (x ∈ P)) ∧ (¬(x ∈ Q) → ¬(x ∈ A))

истинно (т. е. принимает значение 1) при любом значении переменной х. 
Определите наибольшее возможное количество элементов множества A.
'''

def f(x, A):
    P =   {2, 4, 6, 8, 10, 12, 14, 16, 18, 20}
    Q =   {3, 6, 9, 12, 15, 18, 21, 24, 27, 30}
    return ((x in A) <= (x in P)) and ((not(x in Q)) <= (not(x in A)))

a = {c for c in range(1, 100)}
for x in range(1, 100):
    if not f(x, a):
        a.remove(x)
print(a)
